wfreliszka/RIOT-Xtensa-ESP/cpu/atmega_common/periph/gpio.c
/*
 * Copyright (C) 2015 HAW Hamburg
 *               2016 INRIA

 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup     cpu_atmega_common
 * @ingroup     drivers_periph_gpio
 * @{
 *
 * @file
 * @brief       Low-level GPIO driver implementation for ATmega family
 *
 * @author      René Herthel <rene-herthel@outlook.de>
 * @author      Francisco Acosta <francisco.acosta@inria.fr>
 * @author      Laurent Navet <laurent.navet@gmail.com>
 * @author      Robert Hartung <hartung@ibr.cs.tu-bs.de>
 * @author      Torben Petersen <petersen@ibr.cs.tu-bs.de>
 * @author      Marian Buschsieweke <marian.buschsieweke@ovgu.de>
 *
 * @}
 */

#include <stdio.h>

#include <avr/interrupt.h>

#include "cpu.h"
#include "board.h"
#include "periph/gpio.h"
#include "periph_conf.h"
#include "periph_cpu.h"

#define ENABLE_DEBUG            (0)
#include "debug.h"

#define GPIO_BASE_PORT_A        (0x20)
#define GPIO_OFFSET_PORT_H      (0xCB)
#define GPIO_OFFSET_PIN_PORT    (0x02)
#define GPIO_OFFSET_PIN_PIN     (0x03)

#ifdef MODULE_PERIPH_GPIO_IRQ
/*
 * @brief     Define GPIO interruptions for an specific atmega CPU, by default
 *            2 (for small atmega CPUs)
 */

#if defined(INT7_vect)
#define GPIO_EXT_INT_NUMOF      (8U)
#elif defined(INT6_vect)
#define GPIO_EXT_INT_NUMOF      (7U)
#elif defined(INT5_vect)
#define GPIO_EXT_INT_NUMOF      (6U)
#elif defined(INT4_vect)
#define GPIO_EXT_INT_NUMOF      (5U)
#elif defined(INT3_vect)
#define GPIO_EXT_INT_NUMOF      (4U)
#elif defined(INT2_vect)
#define GPIO_EXT_INT_NUMOF      (3U)
#else
#define GPIO_EXT_INT_NUMOF      (2U)
#endif

static gpio_isr_ctx_t config[GPIO_EXT_INT_NUMOF];

/**
 * @brief detects ammount of possible PCINTs
 */
#if defined(MODULE_ATMEGA_PCINT0) || defined(MODULE_ATMEGA_PCINT1) || \
    defined(MODULE_ATMEGA_PCINT2) || defined(MODULE_ATMEGA_PCINT3)
#include "atmega_pcint.h"

/**
 * @brief check which pcints should be enabled!
 */
#ifdef MODULE_ATMEGA_PCINT0
#ifndef ATMEGA_PCINT_MAP_PCINT0
#error \
    Either mapping for pin change interrupt bank 0 is missing or not supported by the MCU
#else
#define PCINT0_IDX (0)
#define _COUNTER0  (1)
#endif /* ATMEGA_PCINT_MAP_PCINT0 */
#else
#define _COUNTER0  (0)
#endif /* MODULE_ATMEGA_PCINT0 */

#ifdef MODULE_ATMEGA_PCINT1
#ifndef ATMEGA_PCINT_MAP_PCINT1
#error \
    Either mapping for pin change interrupt bank 1 is missing or not supported by the MCU
#else
#define PCINT1_IDX _COUNTER0
#define _COUNTER1 (_COUNTER0 + 1)
#endif /* ATMEGA_PCINT_MAP_PCINT1 */
#else
#define _COUNTER1 _COUNTER0
#endif /* MODULE_ATMEGA_PCINT1 */

#ifdef MODULE_ATMEGA_PCINT2
#ifndef ATMEGA_PCINT_MAP_PCINT2
#error \
    Either mapping for pin change interrupt bank 2 is missing or not supported by the MCU
#else
#define PCINT2_IDX _COUNTER1
#define _COUNTER2 (_COUNTER1 + 1)
#endif /* ATMEGA_PCINT_MAP_PCINT2 */
#else
#define _COUNTER2 _COUNTER1
#endif /* MODULE_ATMEGA_PCINT2 */

#ifdef MODULE_ATMEGA_PCINT3
#ifndef ATMEGA_PCINT_MAP_PCINT3
#error \
    Either mapping for pin change interrupt bank 3 is missing or not supported by the MCU
#else
#define PCINT3_IDX _COUNTER2
#define _COUNTER3 (_COUNTER2 + 1)
#endif /* ATMEGA_PCINT_MAP_PCINT3 */
#else
#define _COUNTER3 _COUNTER2
#endif /* MODULE_ATMEGA_PCINT3 */

#define PCINT_NUM_BANKS (_COUNTER3)

/**
 * @brief stores the last pcint state of each port
 */
static uint8_t pcint_state[PCINT_NUM_BANKS];

/**
 * @brief stores all cb and args for all defined pcint.
 */
typedef struct {
    gpio_flank_t flank;     /**< type of interrupt the flank should be triggered on */
    gpio_cb_t cb;           /**< interrupt callback */
    void *arg;              /**< optional argument */
} gpio_isr_ctx_pcint_t;

/**
 * @brief
 */
static const gpio_t pcint_mapping[] = {
#ifdef PCINT0_IDX
    ATMEGA_PCINT_MAP_PCINT0,
#endif /* PCINT0_IDX */
#ifdef PCINT1_IDX
    ATMEGA_PCINT_MAP_PCINT1,
#endif /* PCINT1_IDX */
#ifdef PCINT2_IDX
    ATMEGA_PCINT_MAP_PCINT2,
#endif /* PCINT2_IDX */
#ifdef PCINT3_IDX
    ATMEGA_PCINT_MAP_PCINT3,
#endif /* PCINT3_IDX */
};
/**
 * @brief
 */
static gpio_isr_ctx_pcint_t pcint_config[8 * PCINT_NUM_BANKS];
#endif  /* MODULE_ATMEGA_PCINTn */

#endif  /* MODULE_PERIPH_GPIO_IRQ */

/**
 * @brief     Extract the pin number of the given pin
 */
static inline uint8_t _pin_num(gpio_pin_t pin)
{
    return (pin & 0x0f);
}

/**
 * @brief     Extract the port number of the given pin
 */
static inline uint8_t _port_num(gpio_pin_t pin)
{
    return (pin >> 4) & 0x0f;
}

/**
 * @brief     Generate the PORTx address of the give pin.
 */
static inline uint16_t _port_addr(gpio_pin_t pin)
{
    uint8_t port_num = _port_num(pin);
    uint16_t port_addr = port_num * GPIO_OFFSET_PIN_PIN;

    port_addr += GPIO_BASE_PORT_A;
    port_addr += GPIO_OFFSET_PIN_PORT;

#if defined (PORTG)
    if (port_num > PORT_G) {
        port_addr += GPIO_OFFSET_PORT_H;
    }
#endif
    return port_addr;
}

/**
 * @brief     Generate the DDRx address of the given pin
 */
static inline uint16_t _ddr_addr(gpio_pin_t pin)
{
    return (_port_addr(pin) - 0x01);
}

/**
 * @brief     Generate the PINx address of the given pin.
 */
static inline uint16_t _pin_addr(gpio_pin_t pin)
{
    return (_port_addr(pin) - 0x02);
}

int gpio_cpu_init(void *dev, gpio_pin_t pin, gpio_mode_t mode)
{
    (void)dev;
    uint8_t pin_mask = (1 << _pin_num(pin));

    switch (mode) {
        case GPIO_OUT:
            _SFR_MEM8(_ddr_addr(pin)) |= pin_mask;
            break;
        case GPIO_IN:
            _SFR_MEM8(_ddr_addr(pin)) &= ~pin_mask;
            _SFR_MEM8(_port_addr(pin)) &= ~pin_mask;
            break;
        case GPIO_IN_PU:
            _SFR_MEM8(_ddr_addr(pin)) &= ~pin_mask;
            _SFR_MEM8(_port_addr(pin)) |= pin_mask;
            break;
        default:
            return -1;
    }

    return 0;
}

int gpio_cpu_read(void *dev, gpio_pin_t pin)
{
    (void)dev;
    return (_SFR_MEM8(_pin_addr(pin)) & (1 << _pin_num(pin)));
}

void gpio_cpu_set(void *dev, gpio_pin_t pin)
{
     (void)dev;
   _SFR_MEM8(_port_addr(pin)) |= (1 << _pin_num(pin));
}

void gpio_cpu_clear(void *dev, gpio_pin_t pin)
{
    (void)dev;
    _SFR_MEM8(_port_addr(pin)) &= ~(1 << _pin_num(pin));
}

void gpio_cpu_toggle(void *dev, gpio_pin_t pin)
{
    if (gpio_cpu_read(dev, pin)) {
        gpio_cpu_clear(dev, pin);
    }
    else {
        gpio_cpu_set(dev, pin);
    }
}

void gpio_cpu_write(void *dev, gpio_pin_t pin, int value)
{
    if (value) {
        gpio_cpu_set(dev, pin);
    }
    else {
        gpio_cpu_clear(dev, pin);
    }
}

#ifdef MODULE_PERIPH_GPIO_IRQ
static inline int8_t _int_num(gpio_pin_t pin)
{
    uint8_t num;
    const gpio_pin_t ext_ints[GPIO_EXT_INT_NUMOF] = CPU_ATMEGA_EXT_INTS;

    /* find pin in ext_ints array to get the interrupt number */
    for (num = 0; num < GPIO_EXT_INT_NUMOF; num++) {
        if (pin == ext_ints[num]) {
            return num;
        }
    }

    return -1;
}

int gpio_cpu_init_int(void *dev, gpio_pin_t pin, gpio_mode_t mode, gpio_flank_t flank,
                  gpio_cb_t cb, void *arg)
{
    int8_t int_num = _int_num(pin);

    /* mode not supported */
    if ((mode != GPIO_IN) && (mode != GPIO_IN_PU)) {
        return -1;
    }

    /* not a valid interrupt pin. Set as pcint instead if pcints are enabled */
    if (int_num < 0) {
        /* If pin change interrupts are enabled, enable mask and interrupt */
 #ifdef PCINT_NUM_BANKS
        int8_t offset = -1;
        uint8_t pin_num = _pin_num(pin);

        for (unsigned i = 0; i < ARRAY_SIZE(pcint_mapping); i++) {
            if (pin != GPIO_UNDEF && pin == pcint_mapping[i]) {
                offset = i;
                break;
            }
        }

        /* if pcint was not found: return -1  */
        if (offset < 0) {
            return offset;
        }

        uint8_t bank = offset / 8;
        uint8_t bank_idx = offset % 8;
        DEBUG("PCINT enabled for bank %u offset %u\n",
              (unsigned)bank, (unsigned)offset);

        /* save configuration for pin change interrupt */
        pcint_config[offset].flank = flank;
        pcint_config[offset].arg = arg;
        pcint_config[offset].cb = cb;

        /* init gpio */
        gpio_cpu_init(pin, mode);
        /* configure pcint */
        cli();
        switch (bank) {
#ifdef PCINT0_IDX
            case PCINT0_IDX:
                PCMSK0 |= (1 << bank_idx);
                PCICR |= (1 << PCIE0);
                break;
#endif /* PCINT0_IDX */
#ifdef PCINT1_IDX
            case PCINT1_IDX:
                PCMSK1 |= (1 << bank_idx);
                PCICR |= (1 << PCIE1);
                break;
#endif /* PCINT1_IDX */
#ifdef PCINT2_IDX
            case PCINT2_IDX:
                PCMSK2 |= (1 << bank_idx);
                PCICR |= (1 << PCIE2);
                break;
#endif /* PCINT2_IDX */
#ifdef PCINT3_IDX
            case PCINT3_IDX:
                PCMSK3 |= (1 << pin_num);
                PCICR |= (1 << PCIE3);
                break;
#endif /* PCINT3_IDX */
            default:
                return -1;
                break;
        }
        /* As ports are mixed in a bank (e.g. PCINT0), we can only save a single bit here! */
        uint8_t port_value = (_SFR_MEM8(_pin_addr( pin )));
        uint8_t pin_mask = (1 << pin_num);
        uint8_t pin_value = ((port_value & pin_mask) != 0);
        if (pin_value) {
            pcint_state[bank] |= pin_mask;
        }
        else {
            pcint_state[bank] &= ~pin_mask;
        }
        sei();
        return 0;
        #endif /* GPIO_PC_INT_NUMOF */
        return -1;
    }

    /* flank not supported */
    if (flank > GPIO_RISING) {
        return -1;
    }

    gpio_cpu_init(dev, pin, mode);

    /* clear global interrupt flag */
    cli();

    /* enable interrupt number int_num */
    EIFR |= (1 << int_num);
    EIMSK |= (1 << int_num);

    /* apply flank to interrupt number int_num */
    if (int_num < 4) {
        EICRA &= ~(0x3 << (int_num * 2));
        EICRA |= (flank << (int_num * 2));
    }
    #if defined(EICRB)
    else {
        EICRB &= ~(0x3 << ((int_num % 4) * 2));
        EICRB |= (flank << ((int_num % 4) * 2));
    }
    #endif

    /* set callback */
    config[int_num].cb = cb;
    config[int_num].arg = arg;

    /* set global interrupt flag */
    sei();

    return 0;
}

void gpio_cpu_irq_enable(void *dev, gpio_pin_t pin)
{
    (void)dev;
    EIFR |= (1 << _int_num(pin));
    EIMSK |= (1 << _int_num(pin));
}

void gpio_cpu_irq_disable(void *dev, gpio_pin_t pin)
{
    (void)dev;
    EIMSK &= ~(1 << _int_num(pin));
}

static inline void irq_handler(uint8_t int_num)
{
    __enter_isr();
    config[int_num].cb(config[int_num].arg);
    __exit_isr();
}

#ifdef PCINT_NUM_BANKS
/* inline function that is used by the PCINT ISR */
static inline void pcint_handler(uint8_t bank, uint8_t enabled_pcints)
{
    __enter_isr();
    /* Find right item */
    uint8_t idx = 0;

    while (enabled_pcints > 0) {
        /* check if this pin is enabled & has changed */
        if (enabled_pcints & 0x1) {
            /* get pin from mapping (assumes 8 entries per bank!) */
            gpio_t pin = pcint_mapping[bank * 8 + idx];
            /* re-construct mask from pin */
            uint8_t pin_mask = (1 << (_pin_num(pin)));
            uint8_t idx_mask = (1 << idx);
            uint8_t port_value = (_SFR_MEM8(_pin_addr( pin )));
            uint8_t pin_value = ((port_value & pin_mask) != 0);
            uint8_t old_state = ((pcint_state[bank] & idx_mask) != 0);
            gpio_isr_ctx_pcint_t *conf = &pcint_config[bank * 8 + idx];
            if (old_state != pin_value) {
                pcint_state[bank] ^= idx_mask;
                if ((conf->flank == GPIO_BOTH ||
                     (pin_value && conf->flank == GPIO_RISING) ||
                     (!pin_value && conf->flank == GPIO_FALLING))) {
                    /* execute callback routine */
                    conf->cb(conf->arg);
                }
            }
        }
        enabled_pcints = enabled_pcints >> 1;
        idx++;
    }

    __exit_isr();
}
#if defined(PCINT0_IDX)
ISR(PCINT0_vect, ISR_BLOCK)
{
    pcint_handler(PCINT0_IDX, PCMSK0);
}
#endif /* PCINT0_IDX */

#if defined(PCINT1_IDX)
ISR(PCINT1_vect, ISR_BLOCK)
{
    pcint_handler(PCINT1_IDX, PCMSK1);
}
#endif  /* PCINT1_IDX */

#if defined(PCINT2_IDX)
ISR(PCINT2_vect, ISR_BLOCK)
{
    pcint_handler(PCINT2_IDX, PCMSK2);
}
#endif  /* PCINT2_IDX */

#if defined(PCINT3_IDX)
ISR(PCINT3_vect, ISR_BLOCK)
{
    pcint_handler(PCINT3_IDX, PCMSK3);
}
#endif  /* PCINT3_IDX */

#endif  /* GPIO_PC_INT_NUMOF */

ISR(INT0_vect, ISR_BLOCK)
{
    irq_handler(0); /**< predefined interrupt pin */
}

ISR(INT1_vect, ISR_BLOCK)
{
    irq_handler(1); /**< predefined interrupt pin */
}

#if defined(INT2_vect)
ISR(INT2_vect, ISR_BLOCK)
{
    irq_handler(2); /**< predefined interrupt pin */
}
#endif

#if defined(INT3_vect)
ISR(INT3_vect, ISR_BLOCK)
{
    irq_handler(3); /**< predefined interrupt pin */
}
#endif

#if defined(INT4_vect)
ISR(INT4_vect, ISR_BLOCK)
{
    irq_handler(4); /**< predefined interrupt pin */
}
#endif

#if defined(INT5_vect)
ISR(INT5_vect, ISR_BLOCK)
{
    irq_handler(5); /**< predefined interrupt pin */
}
#endif

#if defined(INT6_vect)
ISR(INT6_vect, ISR_BLOCK)
{
    irq_handler(6); /**< predefined interrupt pin */
}
#endif

#if defined(INT7_vect)
ISR(INT7_vect, ISR_BLOCK)
{
    irq_handler(7); /**< predefined interrupt pin */
}
#endif

#endif /* MODULE_PERIPH_GPIO_IRQ */
